; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=55, out_folder=htg/blocksworld/training, instance_id=35, seed=2059, goal_proportion=0.1

(define (problem blocksworld-35)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 - object)
 (:init 
    (arm-empty)
    (clear b12)
    (on b12 b54)
    (on b54 b25)
    (on b25 b5)
    (on b5 b1)
    (on b1 b47)
    (on b47 b2)
    (on b2 b37)
    (on b37 b48)
    (on-table b48)
    (clear b24)
    (on b24 b19)
    (on-table b19)
    (clear b33)
    (on b33 b26)
    (on b26 b51)
    (on b51 b23)
    (on b23 b53)
    (on-table b53)
    (clear b45)
    (on b45 b21)
    (on b21 b28)
    (on b28 b52)
    (on b52 b22)
    (on b22 b35)
    (on-table b35)
    (clear b4)
    (on b4 b32)
    (on b32 b36)
    (on b36 b49)
    (on b49 b15)
    (on b15 b14)
    (on-table b14)
    (clear b3)
    (on b3 b50)
    (on-table b50)
    (clear b43)
    (on b43 b40)
    (on-table b40)
    (clear b34)
    (on b34 b41)
    (on b41 b18)
    (on b18 b20)
    (on b20 b16)
    (on b16 b44)
    (on-table b44)
    (clear b10)
    (on b10 b8)
    (on b8 b11)
    (on b11 b7)
    (on b7 b42)
    (on-table b42)
    (clear b39)
    (on-table b39)
    (clear b46)
    (on-table b46)
    (clear b31)
    (on b31 b9)
    (on b9 b13)
    (on b13 b29)
    (on b29 b38)
    (on-table b38)
    (clear b17)
    (on b17 b55)
    (on b55 b30)
    (on-table b30)
    (clear b6)
    (on b6 b27)
    (on-table b27))
 (:goal  (and 
    (clear b2)
    (on b2 b3)
    (on b3 b5)
    (on b5 b4)
    (on b4 b1)
    (on-table b1))))

; plan
1. (unstack b12 b54)
   deleted: (on b12 b54) (clear b12) (arm-empty)
   added: (holding b12) (clear b54)
   goals met: 0 of 6
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 6
3. (unstack b54 b25)
   deleted: (on b54 b25) (clear b54) (arm-empty)
   added: (holding b54) (clear b25)
   goals met: 0 of 6
4. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 0 of 6
5. (unstack b25 b5)
   deleted: (on b25 b5) (clear b25) (arm-empty)
   added: (holding b25) (clear b5)
   goals met: 0 of 6
6. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 6
7. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 0 of 6
8. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 1 of 6
9. (unstack b1 b47)
   deleted: (on b1 b47) (clear b1) (arm-empty)
   added: (holding b1) (clear b47)
   goals met: 1 of 6
10. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 6
11. (unstack b47 b2)
   deleted: (on b47 b2) (clear b47) (arm-empty)
   added: (holding b47) (clear b2)
   goals met: 3 of 6
12. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 3 of 6
13. (unstack b2 b37)
   deleted: (on b2 b37) (clear b2) (arm-empty)
   added: (holding b2) (clear b37)
   goals met: 2 of 6
14. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 4 of 6
15. (unstack b5 b4)
   deleted: (on b5 b4) (clear b5) (arm-empty)
   added: (holding b5) (clear b4)
   goals met: 3 of 6
16. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 6
17. (unstack b4 b32)
   deleted: (on b4 b32) (clear b4) (arm-empty)
   added: (holding b4) (clear b32)
   goals met: 3 of 6
18. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 4 of 6
19. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 6
20. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 5 of 6
21. (unstack b2 b3)
   deleted: (on b2 b3) (clear b2) (arm-empty)
   added: (holding b2) (clear b3)
   goals met: 3 of 6
22. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 6
23. (unstack b3 b50)
   deleted: (on b3 b50) (clear b3) (arm-empty)
   added: (holding b3) (clear b50)
   goals met: 4 of 6
24. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 5 of 6
25. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 6
26. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 6 of 6
